
// РУХОМИЙ 4-Х КОЛІСНИЙ РОБОТ,КЕРОВАНИЙ ПО BLUETOOTH - КАНАЛУ ІЗ СМАРТФОНА. Канал А - ПРАВІ ДВИГУНИ. Канал В - ЛІВІ ДВИГУНИ.

//Змінна для збереження даних  про кодові сигнали керування, 
//що поступають із смартфона
char code;

//ініціалізація виводів підключення драйвера моторів L298 до Arduino
//канал А-ПРАВІ ДВИГУНИ
int ENA = 5;
int IN1 = 6; 
int IN2 = 7;

//канал В- ЛІВІ ДВИГУНИ
int IN3 = 8;
int IN4 = 9;
int ENB = 10;



void setup()  // Запускається один раз,коли стартує програма
{
 Serial.begin(9600);  // встановлення режиму роботи послідовного порту   
 // встановлення режиму роботи портів на вихід (OUTPUT)
 //канал А-ПРАВІ ДВИГУНИ
 pinMode(5, OUTPUT);
 pinMode(6, OUTPUT); 
 pinMode(7, OUTPUT);

//канал В- ЛІВІ ДВИГУНИ
 pinMode(8, OUTPUT);
 pinMode(9, OUTPUT); 
 pinMode(10, OUTPUT); 

}

void loop()
{
  // якщо прийшла команда із смартфона
  if(Serial.available()){
  //зчитуємо дані
    code = Serial.read() ; 
     
 
     if(code == 'F'){   //ЯКЩО ПРИЙШЛА КОМАНДА 'F'=  РУХАЄМОСЬ ВПЕРЕД
      digitalWrite(IN1, HIGH); //Встановлює  напрям обертання двигунів  ВПЕРЕД Каналу А
      digitalWrite(IN2, LOW);   //
      analogWrite(ENA, 255);   // двигуни на Каналі А крутяться з максимальною швидкістю
      
      digitalWrite(IN3, LOW); //Встановлює  напрям обертання двигунів  ВПЕРЕД  Каналу B
      digitalWrite(IN4, HIGH);   //
      analogWrite(ENB, 255);   // двигуни на Каналі В крутяться з максимальною швидкістю
    }
     if(code == 'G'){   //ЯКЩО ПРИЙШЛА КОМАНДА 'G'=  РУХАЄМОСЬ  ЛІВОРУЧ ВПЕРЕД
      digitalWrite(IN1, HIGH); //Встановлює  напрям обертання двигунів  ВПЕРЕД Каналу А
      digitalWrite(IN2, LOW);   //
      analogWrite(ENA, 255);   // двигуни на Каналі А крутяться з максимальною швидкістю
      
      digitalWrite(IN3, LOW); //Встановлює  напрям обертання двигунів  ВПЕРЕД  Каналу B
      digitalWrite(IN4, HIGH); //
      analogWrite(ENB, 40);   // двигуни на Каналі В крутяться з мінімальною швидкістю
    }
    
     if(code == 'L'){  // ЯКЩО ПРИЙШЛА КОМАНДА'L'= РУХАЄМОСЬ ЛІВОРУЧ
      digitalWrite(IN1, HIGH); //Встановлює  напрям обертання двигунів  ВПЕРЕД  Каналу А
      digitalWrite(IN2, LOW);   //
      analogWrite(ENA, 255);   // двигуни  Каналу B обертаються на половину швидкості
     
      digitalWrite(IN3, HIGH); //Встановлює  напрям обертання двигунів НАЗАД у КаналІ B
      digitalWrite(IN4, LOW);  //
      analogWrite(ENB, 127);   // двигуни  Каналу B обертаються на половину швидкості 127
    }

    if(code == 'I'){   //ЯКЩО ПРИЙШЛА КОМАНДА 'I'=  РУХАЄМОСЬ  ПРАВОРУЧ ВПЕРЕД
      
      digitalWrite(IN1, HIGH); //Встановлює  напрям обертання двигунів  ВПЕРЕД Каналу А
      digitalWrite(IN2, LOW);   //
      analogWrite(ENA, 40);   // двигуни на Каналі А крутяться з мінімальною швидкістю 40
      
      digitalWrite(IN3, LOW); //Встановлює  напрям обертання двигунів  ВПЕРЕД  Каналу B
      digitalWrite(IN4, HIGH); //
      analogWrite(ENB, 255);   // двигуни на Каналі В крутяться з мінімальною швидкістю
    }
    
     if(code == 'R'){  //ЯКЩО ПРИЙШЛА КОМАНДА 'R'= РУХАЄМОСЬ ПРАВОРУЧ
      
      digitalWrite(IN1, LOW); //Встановлює бертання двигунів НАЗАД Каналу А
      digitalWrite(IN2, HIGH);   //
      analogWrite(ENA, 127);   // двигун на Каналі А  обертається на половину швидкості
     
      digitalWrite (IN3, LOW );//Встановлює  напрям обертання двигунів  ВПЕРЕД у КаналІ B
      digitalWrite (IN4, HIGH ); 
      analogWrite(ENB, 255);   // двигун на Каналі В обертається на половину швидкості 127
    }
    
     if(code == 'B'){   // ЯКЩО ПРИЙШЛА КОМАНДА 'B'= РУХАЄМОСЬ НАЗАД
      
       digitalWrite (IN2, HIGH);//Встановлює бертання двигунів НАЗАД Каналу А
       digitalWrite (IN1, LOW);
       analogWrite(ENA, 255);   // двигуни на Каналі А крутяться з максимальною швидкістю 255
       
       digitalWrite (IN4, LOW);//Встановлює  напрям обертання двигунів НАЗАД у КаналІ B
       digitalWrite (IN3, HIGH);
      analogWrite(ENB, 255);   // двигуни на Каналі В крутяться з максимальною швидкістю 255
    }

     if(code == 'H'){   // ЯКЩО ПРИЙШЛА КОМАНДА 'H'= РУХАЄМОСЬ ЛІВОРУЧ НАЗАД
      // Робот рухається НАЗАД
       digitalWrite (IN2, HIGH);//Встановлює напрям обертання двигунів НАЗАД Каналу А
       digitalWrite (IN1, LOW);
       analogWrite(ENA, 255);   // двигуни на Каналі А крутяться з максимальною швидкістю 255
       
       digitalWrite (IN4, LOW);//Встановлює  напрям обертання двигунів НАЗАД у КаналІ B
       digitalWrite (IN3, HIGH);
       analogWrite(ENB, 40);   // двигуни на КаналІ B крутяться з мінімальною швидкістю 40
    }
    

    if(code == 'J'){   // ЯКЩО ПРИЙШЛА КОМАНДА 'J' = РУХАЄМОСЬ ПРАВОРУЧ НАЗАД
      
       digitalWrite (IN2, HIGH);//Встановлює напрям обертання двигунів НАЗАД Каналу А
       digitalWrite (IN1, LOW);
       analogWrite(ENA, 40); // двигуни на Каналі А крутяться з мінімальною швидкістю 40
       
       digitalWrite (IN4, LOW);//Встановлює  напрям обертання двигунів НАЗАД у КаналІ B
       digitalWrite (IN3, HIGH);
       analogWrite(ENB, 255);  // двигуни на КаналІ B крутяться з максимальною швидкістю 255
    }
    if(code == 'S'){  // ЯКЩО ПРИЙШЛА КОМАНДА 'S'= СТОП
      analogWrite(ENA, 0);  //СТОП  ДВИГУНИ каналу  А
      analogWrite(ENB, 0);  //СТОП  ДВИГУНИ каналу  B
    }
  }
  delay(10);
}
