// Геркон.Сигналізація  сповіщення про відкриті двері
//з виведенням  на екран монітору порту стану дверей -
//"1" - відкриті,"0"- закриті  
int gerkonPin = 7 ; // до висновку 7 підключений геркон
int ledPin = 12 ; // до піну 12 підключений  світлодіод
int g = 0;


int status = 0;

void setup ()
{  
  pinMode ( gerkonPin ,INPUT   ); // задаємо пін 7 в якості входу (будемо зчитувати з нього)
  pinMode ( ledPin , OUTPUT  ); // задаємо вивід 12 як вихід
  Serial . begin ( 9600 ); // задіємо послідовний порт
  }  
   
void loop ()
 
  {
  int g = digitalRead (gerkonPin); // зчитуємо показання з геркона
  Serial.print(g);
 
  digitalWrite ( ledPin , !g ); // інвертовані дані записуємо в порт зі світлодіодом
 
 
  // посилаємо в послідовний порт значення з геркона
  // коли геркон замкнутий, значення "0" (LOW), коли розімкнений - "1" (HIGH)
  Serial . println ( g );

   delay ( 20 ); // повторюємо цикл через 20 мсек
  }
