/* Використання гідрометра (давача вологості грунту)
 *  як сигналізатора стану вологості грунту 
    ввімкненням/вимкненням  світлодіоду.
    При високій вологості- світлодіод  гасне.
    При низькій вологості- світлодіод горить.*/

//задаємо  номери аналогових і цифрових портів як константи
//перед номером аналогових  портів ставимо букву "А", 
//ІНАКШЕ ARDUINO сприйме їх як цифрові порти
#include <LiquidCrystal_I2C.h>
int redled = 10;//змінна з номером цифрового пІна світлодіода
int greenled = 11;
int hiro = A0; // давач вологості грунту аналоговий пін A5 
LiquidCrystal_I2C lcd (0x27,16,2);
void setup() //процедура встановлення режиму роботи портів
{
  lcd.begin (); // ініціалізація LCD
  lcd.backlight (); // включаємо підсвічування
  lcd.clear (); // очищення дисплея
  pinMode(redled, OUTPUT);//вказуємо, що  пін 10 світлодіода led - вихід
  pinMode(greenled, OUTPUT);//вказуємо, що  пін 11 світлодіода led - вихід


// Конфігуріруємо послідовне з'єднання з COM-портом 
//на швидкості  1200 бод
  Serial. begin ( 1200 ); 

}

void loop() //процедура виконання програми

{
  // Одержуємо занчення стану вологості грунту 
  //з аналогового входу A0
  lcd.clear (); // очищення дисплея
  int x = analogRead(hiro);

  //якщо показник вологості грунту менше 300,
  //включаємо світлодіод
  if (analogRead(hiro) > 300) 
  {
    digitalWrite(greenled, LOW);
    digitalWrite(redled, HIGH);
    
  }
  else
  {
    digitalWrite(redled, LOW);
    digitalWrite(greenled, HIGH); //інакше вимикаємо світлодіод
  }
    

  
  
  // для того, щоб побачити показники давача
  //(аналогові значення  від 0 до 1023)
  //через "монітор порту",напишемо блок програми:

  // виведення даних з давача вологості грунту
  //(аналогові значення  від 0 до 1023)на монітор порту
  Serial.print(x); 
  lcd.setCursor (1,0);
  lcd.print(x);    

  
  // повернення каретки - перехід на новий рядок у вікні монітора
  Serial.println("");  
  
  //пауза між появою значень освітленості на моніторі 500 мсек
  delay(500); 

}
