/* Використання гідрометра (давача вологості грунту)
 *  як сигналізатора стану вологості грунту 
    ввімкненням/вимкненням  світлодіоду.
    При високій вологості- світлодіод  гасне.
    При низькій вологості- світлодіод горить.*/
#include <LiquidCrystal_I2C.h>
LiquidCrystal_I2C lcd (0x27,16,2); 

//задаємо  номери аналогових і цифрових портів як константи
//перед номером аналогових  портів ставимо букву "А", 
//ІНАКШЕ ARDUINO сприйме їх як цифрові порти

int led = 10; //змінна з номером цифрового пІна світлодіода
int hiro = A0; // давач вологості грунту аналоговий пін A5 
void setup() //процедура встановлення режиму роботи портів

{

  pinMode(led, OUTPUT);//вказуємо, що  пін 10 світлодіода led - вихід


// Конфігуріруємо послідовне з'єднання з COM-портом 
//на швидкості  1200 бод
  Serial. begin ( 1200 ); 


    lcd.begin (); // ініціалізація LCD
  lcd.backlight (); // включаємо підсвічування
  lcd.clear (); // очищення дисплея
  lcd.setCursor (4,0); // встановлюємо курсор на 4-й символ(позначений 4), 1-й рядок(позначений 0)
  lcd.print ("WATER LEVEL"); // вивід напису в 1-му рядку
  lcd.setCursor (1, 1); // встановлюємо курсор на 1-й символ(позначений 1), 2-й рядок(позначений 1)
  lcd.print ( "level:");// вивід напису в 2-му рядку  
  //lcd.setCursor (8, 1); // встановлюємо курсор на 2-й рядок, 8 символ
  //lcd.print (interval);// вивід часу роботи дисплея

}

void loop() //процедура виконання програми

{
  // Одержуємо занчення стану вологості грунту 
  //з аналогового входу A0
  int x = analogRead(hiro);

  //якщо показник вологості грунту менше 300,
  //включаємо світлодіод
  if (analogRead(hiro) > 300) 
  digitalWrite(led, HIGH);

  else digitalWrite(led, LOW); //інакше вимикаємо світлодіод
  
  
  // для того, щоб побачити показники давача
  //(аналогові значення  від 0 до 1023)
  //через "монітор порту",напишемо блок програми:

  // виведення даних з давача вологості грунту
  //(аналогові значення  від 0 до 1023)на монітор порту
  Serial.print(x); 

  int percentValue = map(x, 1023, 100, 0, 100);
  lcd.setCursor (8, 1); // встановлюємо курсор на 2-й рядок, 8 символ
  lcd.print(percentValue);

  lcd.setCursor (11, 1);
  lcd.print("%");
  
 
  
  // повернення каретки - перехід на новий рядок у вікні монітора
  Serial.println("");  
  
  //пауза між появою значень освітленості на моніторі 500 мсек
  delay(500); 

}
